Revit 2026 API

# RebarSplice Class

---

A class that can used to access the data between two connected Rebars.

SystemObject Autodesk.Revit.DB.StructureRebarSplice

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarSplice : IDisposable
```
```vb
Public Class RebarSplice
	Implements IDisposable
```
```cpp
public ref class RebarSplice : IDisposable
```
```fsharp
type RebarSplice =
    class
        interface IDisposable
    end
```

The RebarSplice type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectedRebarEnd | Identifies the end of the connected rebar which is part of this splice - 0 for start, 1 for end. |
|  | ConnectedRebarId | Identifies the connected rebar id of this rebar splice object. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SourceRebarEnd | Identifies the end of the source rebar which is part of this rebar splice - 0 for start, 1 for end. The source rebar is the one from which this rebar splice was obtained. |
|  | SourceRebarId | Identifies the source of the target rebar which is part of this rebar splice. The source rebar is the one from which this rebar splice was obtained. |
|  | SplicePosition | Identifies the splice position. |
|  | SpliceTypeId | Identifies the id of the Rebar Splice Type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarSplice |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRebarSpliceGeometry | Gets the RebarSpliceGeometry. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | MoveRebarSpliceGeometry | Moves the RebarSpliceGeometry with the specified vector. |
|  | RotateRebarSpliceGeometry | Rotates the RebarSpliceGeometry about the given axis and angle. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace